def area(a, h):
'''
Возвращает площадь треугольника.

 Параметры:
            a(int/float)-сторона треугольника.
            h(int/float)-проведённая к ней высота.

 Возвращаемое значение:
            Площадь треугольника a * h / 2. 
'''
return a * h / 2

def perimeter(a, b, c):
'''
Возвращает периметр треугольника.

 Параметры:
            a(int/float)-сторона треугольника.
            h(int/float)-проведённая к ней высота.

 Возвращаемое значение:
            Периметр треугольника a + b + c. 
'''
return a + b + c
